# Ultralytics YOLO11-obb Oriented Bounding Boxes (OBB) model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/obb

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb.yaml' will call yolo11-obb.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 344 layers, 2695747 parameters, 2695731 gradients, 6.9 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9744931 parameters, 9744915 gradients, 22.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 434 layers, 20963523 parameters, 20963507 gradients, 72.2 GFLOPs
  l: [1.00, 1.00, 512] # summary: 656 layers, 26220995 parameters, 26220979 gradients, 91.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 656 layers, 58875331 parameters, 58875315 gradients, 204.3 GFLOPs

# YOLO11n backbone with side CNN integrated
backbone:
  - [[-1], 1, Concat, [1]]  # 0 - Dummy layer that does nothing but pass the input image
  # Side CNN layers
  - [0, 1, Conv, [64, 3, 2]]  # 1
  - [-1, 1, Conv, [128, 3, 2]]  # 2 
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3 
  - [-1, 1, Conv, [256, 3, 2]]  # 4 
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5 
  - [-1, 1, Conv, [512, 3, 2]]  # 6 
  - [-1, 2, C3k2, [512, True]]  # 7 
  - [-1, 1, Conv, [1024, 3, 2]]  # 8 
  - [-1, 2, C3k2, [1024, True]]  # 9 
 
  # backbone
  - [0, 1, Conv, [64, 3, 2]]  # 10 
  - [-1, 1, Conv, [128, 3, 2]]  # 11 
  - [-1, 2, C3k2, [256, False, 0.25]]  # 12 
  - [-1, 1, Conv, [256, 3, 2]]  # 13 
  - [-1, 2, C3k2, [512, False, 0.25]]  # 14 
  - [-1, 1, Conv, [512, 3, 2]]  # 15 
  - [-1, 2, C3k2, [512, True]]  # 16 
  - [-1, 1, Conv, [1024, 3, 2]]  # 17 
  - [-1, 2, C3k2, [1024, True]]  # 18 
  - [9, 1, SEblock, [256, 1, 1]]  # 19 
  
    # Concatenate features from backbone and side CNN
  - [[18, 19], 1, Add, [1]]  # 20 - Concatenate outputs from backbone and side CNN
  - [-1, 1, SPPF, [1024, 5]]  # 21 
  - [-1, 2, C2PSA, [1024]]  # 22

# YOLO head layers
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 23 - Upsample
  - [[-1, 16], 1, Concat, [1]]  # 24 - Concatenate with backbone P4
  - [-1, 2, C3k2, [512, False]]  # 25 - Head layer 1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 26 - Upsample
  - [[-1, 14], 1, Concat, [1]]  # 27 - Concatenate with backbone P3
  - [-1, 2, C3k2, [256, False]]  # 28 - Head layer 2 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 29 - Head layer 3
  - [[-1, 25], 1, Concat, [1]]  # 30 - Concatenate with head P4
  - [-1, 2, C3k2, [512, False]]  # 31 - Head layer 4 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 32 - Head layer 5
  - [[-1, 22], 1, Concat, [1]]  # 33 - Concatenate with head P5
  - [-1, 2, C3k2, [1024, True]]  # 34 - Head layer 6 (P5/32-large)

  - [[28, 31, 34], 1, Detect, [nc]]  # 35 - Detect(P3, P4, P5)